#მეგობრებო, ქვემოთ კომენტარის სახედ მოცემულია დავალების პირობები. ყოველი ამოცანის ქვეშ დაწერეთ თქვენი პასუხი. პითონ ფაილის ჩამოტვირთვისას დააწერეთ davaleba 1 - elena bliadze.py 
# ოღონდ elena bliadze -ს ნაცვლად თქვენი სახელი და გვარი. გისურვებთ წარმატებას !



# 1.	დაწერეთ კოდი, რომელიც გამოიტანს შემდეგ კითხვას „ What do you call a bear with no teeth?“  
# და პასუხად გამოუტანს „ A gummy bear!” ეცადე, რომ განალაგო ისინი ერთ ხაზზე.

# quetion= " What do you call a bear with no teeth?"
# answer=" A gummy bear!"
# print(quetion," - ",answer)

# 2.	დაწერე პროგრამა, რომელიც მომხარებელს შეაყვანინებს ორ რიცხვს და შემდეგ შედეგად დაბეჭდავს („Total is :”, შედეგი)

# x=eval(input("enter first numb: "))
# y=eval(input("enter second numb: "))
# jami=x+y
# print("total is: ",jami)

# 3.	დაწერე პროგრამა, რომელიც მომხმარებელს შეაყვანინებს 3 რიცხვს.
# შეაჯამებთ პირველი 2 რიცხვი და შემდგომ გაამრავლეთ მესამეზე. დაბეჭდეთ შედეგი და პრინტში მიუთითეთ თქვენთვის სასურველი ტექსტი.

# x=eval(input("enter firts numb: "))
# y=eval(input("enter second  numb: "))
# z=eval(input("sheiyvane  third numb: "))
# print("moqmedebis shedegi udris: ",(x+y)*z)


# 4.	დაწერეთ პროგრამა, რომელიც მომხმარებელს კითხავს რამდენი პიცის ნაჭერი ქონდა და რამდენი შეჭამა. 
# გამოითვალეთ რამდენი ნაჭერი დარჩა და შედეგი თქვენთვის სასურველი ფორმით გამოიტანეთ.

# x=int(input("amout of slices you had: "))
# y=int(input("amount of slices you ate: "))
# z=x-y
# print("amount of slices you left: ",z)

# 5.  1 კილოგრამში 2204 ფუნტია. შესთავაზეთ მომხმარებელს შეიყვანოს მისი წონა კილოგრამებში, ცოლო თქვენმა პროგრამამ გადაიყვანოს ის ფუტებში.

# x=eval(input("enter your weight in kg: "))
# y=x*2.204
# print("your weight in pounds is: ",y)

# 6. დაწერე მოცემული ბლოკისთვის პროგრამა if, else, elif ის გამოყენებით: ( სურათი განთავსებულია ცალკე)








# 7. შესთავაზეთ მომხმარებელს შეიყვანოს რიცხვები 10 დან 20 ის ჩათვლით. 
# თუ რიცხვი მომხმარებლის მიერ შეყვანილი იქნება, მოცემული დიაპაზონიდან, პროგრამამ დაპრინტოს „Thank you” 
# საწინააღმდეგო შემთხვევაში დაპრინტოს „Incorrect answer”.

# x=eval(input("enter number between 10 and 20: "))
# if (x>10 and x<=20):
#     print("thank you")
# else:
#     print("incorrect answer")

# 8. შეაყვანინეთ მომხმარებელს მისი სახელი, გვარი და ასაკი. თუ ასაკი 18 წელია ან/ და მეტი მაშინ დაბეჭდეთ „(name) cavn vote “,
# თუ 17 ის ტოლია  „ (name, surname) can learn to drive” , 
# თუ 16 მაშინ „ (name) can go Trick-or Treating”.

# 9. შეაყვანინეთ მომხმარებელს ინფორმაცია ტემპერატურაზე ფარენგეიტებში და მოცემული ფორმულის მეშვეობით C=(F-32)*5/9 გადაიყვანე ცელსიუსში. არ დაგავიწყდეს განსაზღვრო სწორი შესაყვანი რიცხვის ტიპი.
# შემდეგ გამოიყენე and, or , not , ასევე ორზე მეტი პირობის ქონის შესაძლებლობა და დაუბეჭდე რა შემთხვევაში შეიძლება რომ ქონდეს ქოლგა, ა რა შემთხვევაში უნდა ჩაიცვას თბილად ან თხლად. 
# გამოიყენე შენი კრეატიულობა.

# 10. შემოაყვაანინე მომხმარებელს რიცხვები და შეამოწმე არიან კენტი თუ ლუწი, და 7 ზე გაყოფის შემთხვევაში რომელს აქვს ნაშთი, 2, 3, 4, 5 . მიფიქრე და დაუბეჭდე შენთვის სასურველი მესიჯები.